# vsoCanEditParam

## Description
Inticated whether a parameter can edited by a worksheet

```pascal
PROCEDURE vsoCanEditParam(canEditParam : BOOLEAN);
```

```python
def vs.vsoCanEditParam(canEditParam):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|canEditParam|BOOLEAN|   |

## Examples
```pascal
vsoCanEditParam(TRUE);
```
```python
import vs

# Inticated whether a parameter can edited by a worksheet.
canEditParam = True

vs.vsoCanEditParam(canEditParam)
```

## Version
Availability: from Vectorworks 2017

## Category
* Object Events